test/logs_soap_stress_crossVM/k6.log
     execution: local
        script: test_read_stressTest_soap.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 10m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=367.43ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 1959654 3264.81764/s
    checks_succeeded...................: 99.45%  1949051 out of 1959654
    checks_failed......................: 0.54%   10603 out of 1959654

    ✓ status is 200
    ✗ response time < 1s
      ↳  98% — ✓ 969224 / ✗ 10603


  HTTP
    http_req_duration.......................................................: avg=151.74ms min=79.43ms med=105.74ms max=6.14s p(90)=209.7ms p(95)=367.43ms
      { expected_response:true }............................................: avg=151.74ms min=79.43ms med=105.74ms max=6.14s p(90)=209.7ms p(95)=367.43ms
    http_req_failed.........................................................: 0.00%  0 out of 979827
    http_reqs...............................................................: 979827 1632.40882/s

    EXECUTION
    iteration_duration......................................................: avg=152.89ms min=79.5ms  med=106.31ms max=6.35s p(90)=213ms   p(95)=368.73ms
    iterations..............................................................: 979827 1632.40882/s
    vus.....................................................................: 499    min=1           max=499
    vus_max.................................................................: 500    min=500         max=500

    NETWORK
    data_received...........................................................: 621 MB 1.0 MB/s
    data_sent...............................................................: 508 MB 846 kB/s



running (10m00.2s), 000/500 VUs, 979827 complete and 0 interrupted iterations
default ✓ [======================================] 000/500 VUs  10m0s